Revit 2027 API
MEPAnalyticalSegment.StartNode Property
 The id of the start analytical node.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int StartNode { get; }
Public ReadOnly Property StartNode As Integer
	Get
public:
property int StartNode {
	int get ();
}
member StartNode : int with get
Property Value
Int32
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace